// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "更新韌體";

// Errors
FileOpenError = "無法開啟檔案 %@";
FileOpenErrorExplanation = "此檔案可能已經毀損或已經移到其他位置、重新命名、或刪除。請檢查檔案位置或選取其他檔案，並再試一次。";
PrintChannelOpenError = "無法開啟印表機通道";
PrintChannelOpenErrorExplanation = "請檢查您的印表機已經連線且開啟並再試一次。";
SendDataError = "無法傳送資料到印表機上";
SendDataErrorExplanation = "請檢查您的印表機已經連線且開啟並再試一次。";

SomePenErrorTitle = "無法更新韌體";
DoorOpenMsg = "無法更新韌體，因為有蓋板打開。請闔上印表機的所有蓋板。";

// Aquamarine Errors
FileCheckError = "無法更新韌體";
FileCheckErrorExplanation = "韌體套件無效。請選擇其他檔案並再試一次。";

OkButton = "確定";
CancelButton = "取消";
FirmwareUpdateTitle = "更新韌體";
FirmwareUpdateDeviceState = "列印中";
FirmwareUpdateCancelingDeviceState = "取消中";

// Great Wall Messages
PrinterIdleWarning = "如果您的印表機在忙碌中(例如在列印工作或進行校準)，則韌體更新可能失敗。\n\n在進行韌體更新程序之前，請先檢查您的印表機是否在閒置狀態。";
UpdateSuccessful = "已成功上傳韌體檔案且即將更新您的印表機。\n\n韌體更新完成之後，您的印表機將會自動重新開機。";
InvalidPackage = "韌體檔案發生問題，韌體更新程序未能順利完成。問題可能肇因於傳輸錯誤。\n\n請再試一次韌體更新程序。\n如果問題持續發生，請聯絡 HP 支援。";
FailedDependencies = "由於依存性問題，韌體更新程序無法順利完成。\n\n目前的韌體版本為 %@，但您嘗試安裝的是 %@。\n\n請造訪下列網頁以取得此印表機的適當更新套件：\n%@。";
NotNow = "因為印表機在忙碌中(例如在處理或列印工作)，韌體更新未能順利執行。\n\n請檢查您的印表機是否在閒置狀態，再重新執行韌體更新。";
TransmissionError = "傳輸發生某些問題，導致韌體更新無法順利執行。\n\n請檢查您的印表機連線再重新執行韌體更新。";
LicenseNotAccepted = "因為尚未接受授權，所以尚未執行韌體更新。";
FatalError = "發生問題，使得韌體更新程序無法順利執行。\n\n如果問題持續發生，請聯絡 HP 支援。";

// layout
TaskTitle = "更新韌體";
TaskDescription = "選取包含韌體更新的檔案並將該檔案傳送到印表機上以執行更新。";
FileNameTitle = "檔案名稱：";
FileNameField = "<未選取>";
ChooseButton = "選擇…";
UpdateButton = "更新";
ProgressPanel = "更新程序";
FirmwareUpdateProcessTitle = "更新中…";
